<h1> Developing a Retail Application Database </h3>
<h3> Micah Simmerman </h3>
<h3> CSPB 3287 Semester Project </h3>
Visit the repository: https://github.com/Micah614/P2P_Retail_Database.git

Watch the video: https://www.youtube.com/watch?v=SSqErB0qm8k

In [1]:
import os
import configparser
from sqlalchemy import create_engine, select
import sqlalchemy.sql

mycfg = configparser.ConfigParser()
mycfg.read("/home/jovyan/mysql.cfg")
print(f"User    : [{mycfg['mysql']['user']}]")

database = mycfg['mysql']['url'].split('@')[1]  # leave off the password
print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

db_url = mycfg['mysql']['url'] 
os.environ['DATABASE_URL'] = db_url 
eng = create_engine(db_url)
con = eng.connect()

User    : [jasi9001]
Database: [[mysql://jasi9001...@applied-sql.cs.colorado.edu:3306/jasi9001]

In [2]:
%reload_ext sql
%matplotlib inline
%sql SELECT version()

1 rows affected.

[('8.0.27',)]

In [3]:
%%sql
drop table if exists adminuser;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [4]:
%%sql
DROP TABLE IF EXISTS order_item;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [5]:
%%sql
DROP TABLE IF EXISTS order_details;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [6]:
%%sql
DROP TABLE IF EXISTS user_address;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [7]:
%%sql
drop table if exists user_payment;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [8]:
%%sql
drop table if exists product_inventory;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [9]:
%%sql
drop table if exists product_discount;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [10]:
%%sql
drop table if exists cart_item;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [11]:
%%sql
drop table if exists cart_session;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [12]:
%%sql
drop table if exists product;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [13]:
%%sql
drop table if exists product_category;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [14]:
%%sql
drop table if exists user;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

# Introduction
<hr/>

A primary motivation when designing an ecommerce database is the facilitation of efficient computation and search queries. Other considerations include scaling flexibility and maximizing the schema's compatibility with alternative database systems including popular noSQL databases such as key-value pair, wide-column (AKA column-family), and document databases (e.g., MongoDB). By systematically applying auto-incremented primary keys to each table, we can enable a sparse index on the primary key of every relation in the database. This is an efficient way to organize a relational database as we shall see, enabling information-dense yet compact data representations. The meaninglessness of these integer foreign keys also adds a layer of privacy to each transaction.

The availability of primary keys in this system enables easy joining and comparison of relations accross the entire database schema. Single record as well as range-based lookups are simple and fast. This primary key system also ensures that the data maintains an indication of chronological ordering accross its' lifecycle. This metadata can be useful for fraud detection and recovery from data loss.
<br><br>
The tables in this notebook are designed to support an ecommerce software system in many ways. This support ranges from basic storage of user information to transactions involving credit card data and reciepts.

# The User-Admin Management Tier
<b><hr/></b>

<b>The user-admin management tier stores user data</b>. There are two basic user categories in this system: <b>users with admin privileges</b> and <b>users without</b>. Users with admin privileges are distinguished by their 'admin_type' as we'll see shortly.

In [15]:
%%sql
# User table is the central table in the user-admin management tier.
CREATE TABLE user (
    user_id INT PRIMARY KEY AUTO_INCREMENT,  # INT AUTO primary keys are used accross the database.
    username VARCHAR(30) UNIQUE,
    password NVARCHAR(30),
    first_name VARCHAR(30),
    last_name VARCHAR(30),
    email VARCHAR(300) UNIQUE,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [16]:
user_data_1 = [["user_01","user_passwd_01","Joe","Murr", "user_01_@email.com"],
               ["user_02","user_passwd_02","Brice","Toven", "user_02_@email.com"],
               ["user_03","user_passwd_03","Jen","Jackson", "user_03_@email.com"],
               ["user_04","user_passwd_04","Tammy","Smith", "user_04_@email.com"],
               ["user_05","user_passwd_05","Melanie ","Baldwin", "user_05_@email.com"],
               ["admin_06","admin_passwd_06","Rene ","Pratt", "admin_06_@email.com"],
               ["admin_07","admin_passwd_07","Malik ","Coleman", "admin_07_@email.com"],
               ["admin_08","admin_passwd_08","Sheldon ","Wolf", "admin_08_@email.com"],
               ["admin_09","admin_passwd_09","Ramiro","Blackwell", "admin_09_@email.com"],
               ["admin_10","admin_passwd_10","Suzy","Q", "admin_10_@email.com"],  # Ramiro made two accounts
               # The next two inserts should fail due to UNIQUE unsername and email constraints, respectively.
               # ["user_01","test_password_01","Duplicate","Username", "un_test_email@email.com"],
               # ["poser_08","test_password_08","Duplicate","Email", "user_01_@email.com"]
              ]

In [17]:
insert_users = """
INSERT INTO 
    user (username, password, first_name, last_name, email)
VALUES
    ("%s","%s","%s","%s", "%s");
"""
count = 1
for user in user_data_1:
    try:
        res = con.execute(insert_users, user[0], user[1], user[2], user[3], user[4])
        print("SUCCESS:", user[2], user[3], "insert was successful.")
    except:
        print("FAILED:", user[2], user[3], "insert was unsuccessful.")
    count+=1

SUCCESS: Joe Murr insert was successful.
SUCCESS: Brice Toven insert was successful.
SUCCESS: Jen Jackson insert was successful.
SUCCESS: Tammy Smith insert was successful.
SUCCESS: Melanie  Baldwin insert was successful.
SUCCESS: Rene  Pratt insert was successful.
SUCCESS: Malik  Coleman insert was successful.
SUCCESS: Sheldon  Wolf insert was successful.
SUCCESS: Ramiro Blackwell insert was successful.
SUCCESS: Suzy Q insert was successful.

In [18]:
%%sql
SELECT * FROM user;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
10 rows affected.

[(1, "'user_01'", "'user_passwd_01'", "'Joe'", "'Murr'", "'user_01_@email.com'", datetime.datetime(2023, 5, 4, 4, 11, 51), datetime.datetime(2023, 5, 4, 4, 11, 51)),
 (2, "'user_02'", "'user_passwd_02'", "'Brice'", "'Toven'", "'user_02_@email.com'", datetime.datetime(2023, 5, 4, 4, 11, 51), datetime.datetime(2023, 5, 4, 4, 11, 51)),
 (3, "'user_03'", "'user_passwd_03'", "'Jen'", "'Jackson'", "'user_03_@email.com'", datetime.datetime(2023, 5, 4, 4, 11, 51), datetime.datetime(2023, 5, 4, 4, 11, 51)),
 (4, "'user_04'", "'user_passwd_04'", "'Tammy'", "'Smith'", "'user_04_@email.com'", datetime.datetime(2023, 5, 4, 4, 11, 51), datetime.datetime(2023, 5, 4, 4, 11, 51)),
 (5, "'user_05'", "'user_passwd_05'", "'Melanie '", "'Baldwin'", "'user_05_@email.com'", datetime.datetime(2023, 5, 4, 4, 11, 51), datetime.datetime(2023, 5, 4, 4, 11, 51)),
 (6, "'admin_06'", "'admin_passwd_06'", "'Rene '", "'Pratt'", "'admin_06_@email.com'", datetime.datetime(2023, 5, 4, 4, 11, 51), datetime.datetime(2023, 5, 4, 4, 11, 51)),
 (7, "'admin_07'", "'admin_passwd_07'", "'Malik '", "'Coleman'", "'admin_07_@email.com'", datetime.datetime(2023, 5, 4, 4, 11, 51), datetime.datetime(2023, 5, 4, 4, 11, 51)),
 (8, "'admin_08'", "'admin_passwd_08'", "'Sheldon '", "'Wolf'", "'admin_08_@email.com'", datetime.datetime(2023, 5, 4, 4, 11, 51), datetime.datetime(2023, 5, 4, 4, 11, 51)),
 (9, "'admin_09'", "'admin_passwd_09'", "'Ramiro'", "'Blackwell'", "'admin_09_@email.com'", datetime.datetime(2023, 5, 4, 4, 11, 51), datetime.datetime(2023, 5, 4, 4, 11, 51)),
 (10, "'admin_10'", "'admin_passwd_10'", "'Suzy'", "'Q'", "'admin_10_@email.com'", datetime.datetime(2023, 5, 4, 4, 11, 51), datetime.datetime(2023, 5, 4, 4, 11, 51))]

Check the <b>'modified_at'</b> timestamp trigger by changing Jen Jackson's email address.

In [19]:
%%sql
# Change Jen's email to make sure the update trigger is working properly.
UPDATE user
SET
    email = 'jen_jackson_03@gmail.com'
WHERE
    user_id = 3;
    
SELECT * FROM user WHERE user_id = 3;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.
1 rows affected.

[(3, "'user_03'", "'user_passwd_03'", "'Jen'", "'Jackson'", 'jen_jackson_03@gmail.com', datetime.datetime(2023, 5, 4, 4, 11, 51), datetime.datetime(2023, 5, 4, 4, 11, 52))]

# The adminuser table
<hr/>

### Rene Pratt, Malik Coleman, Sheldon Wolf, and Ramiro Blackwell have different roles in the P2P Ecommmerce system. 

    -Rene is a Business Admin for company X, a company that sells items on the website. She needs access to modify her company's product listings.
    -Malik is a requisitioner for Company X, he manages inventory.
    -Sheldon works in the IT department of our P2P company, and has been on a roll at work lately.
    -Ramiro works in the shipping warehouses, he needs access to check on the status of existing orders.

### The "admin_type" attribute determines the adminuser's database access.

Sheldon just received a promotion that gives him a higher security clearance. Let's see how the adminuser table can help us update his user permissions using Sheldon's user_id. <b>This will also give us a chance to test the on-insert and on-update triggers on the 'created_at' and 'modified_at' attributes, respectively.</b>

In [20]:
%%sql
CREATE TABLE adminuser (
    admin_id INT PRIMARY KEY AUTO_INCREMENT,  # foreign key, references 'user.user_id'
    user_id INT,
    first_name VARCHAR(30),
    last_name VARCHAR(30),
    admin_type VARCHAR(30),  # BusinessAdmin / Requisitioner / IT / Warehouse
    permissions VARCHAR(30),  # '01_admin' / '02_purchaser' / '03_IT' / '04_warehouse'
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    UNIQUE KEY(user_id, first_name),  # duplicate admin records are a no-no.
    CONSTRAINT ADMINUSER_isA_USER FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE # 
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

A table like adminuser can be used to monitor, update, and control user access privileges.

In [21]:
admins = [[6, "Rene ","Pratt", 'BusinessAdmin', '01_admin'],
          [7, "Malik ","Coleman", 'Requisitioner', '02_purchaser'],
          [8, "Sheldon ", "Wolf",  'IT', '03_IT'],
          [9, "Ramiro","Blackwell", 'Warehouse', '04_warehouse'],
          [10, "Suzy","Q", 'Warehouse', '04_warehouse']]

In [22]:
insert_admins = """
INSERT INTO 
    adminuser (user_id, first_name, last_name, admin_type, permissions)
VALUES
    ("%s","%s","%s","%s","%s");
"""

for admin in admins:
    # res = con.execute(insert_admins, admin[0], admin[1], admin[2])
    try:
        res = con.execute(insert_admins, admin[0], admin[1], admin[2], admin[3], admin[4])
        print("Insert for admin:", admin[1], admin[2], "was successful.")
    except:
        print("Insert for admin:", admin[1], admin[2], "has FAILED.")

Insert for admin: Rene  Pratt was successful.
Insert for admin: Malik  Coleman was successful.
Insert for admin: Sheldon  Wolf was successful.
Insert for admin: Ramiro Blackwell was successful.
Insert for admin: Suzy Q was successful.

### Upgrade Sheldon's admin permissions by his employee ID.

In [23]:
%%sql
select * from adminuser;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
5 rows affected.

[(1, 6, "'Rene '", "'Pratt'", "'BusinessAdmin'", "'01_admin'", datetime.datetime(2023, 5, 4, 4, 11, 53), datetime.datetime(2023, 5, 4, 4, 11, 53)),
 (2, 7, "'Malik '", "'Coleman'", "'Requisitioner'", "'02_purchaser'", datetime.datetime(2023, 5, 4, 4, 11, 53), datetime.datetime(2023, 5, 4, 4, 11, 53)),
 (3, 8, "'Sheldon '", "'Wolf'", "'IT'", "'03_IT'", datetime.datetime(2023, 5, 4, 4, 11, 53), datetime.datetime(2023, 5, 4, 4, 11, 53)),
 (4, 9, "'Ramiro'", "'Blackwell'", "'Warehouse'", "'04_warehouse'", datetime.datetime(2023, 5, 4, 4, 11, 53), datetime.datetime(2023, 5, 4, 4, 11, 53)),
 (5, 10, "'Suzy'", "'Q'", "'Warehouse'", "'04_warehouse'", datetime.datetime(2023, 5, 4, 4, 11, 53), datetime.datetime(2023, 5, 4, 4, 11, 53))]

In [24]:
%%sql

UPDATE adminuser
SET
    permissions = '04_IT'
WHERE
    adminuser.admin_id = 3;

SELECT first_name, last_name, admin_type, permissions, created_at, modified_at FROM adminuser
WHERE adminuser.admin_type LIKE '\'IT%\'';

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.
1 rows affected.

[("'Sheldon '", "'Wolf'", "'IT'", '04_IT', datetime.datetime(2023, 5, 4, 4, 11, 53), datetime.datetime(2023, 5, 4, 4, 11, 54))]

<b>Congratulations, Sheldon!</b> 
<br><br>
The <b><u>on-insert</u></b> and <b><u>on-update</u></b> triggers of the <b>'created_at'</b> and <b>'modified_at'</b> columns appear to be working splendidly.

<strong>It will come in handy for us later if we place an index on user_id (above). This way, we can retreive records based on a common user_id.</strong>

In [25]:
%%sql
# Creating well-chosen secondary indexes such as this one can increase record look-up speeds.
CREATE INDEX USER_ADMIN_INDEX  
ON adminuser (user_id);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

# The user_address table
<hr/>

Address information in this table forms a well-normalized schema. Notice that the user's name is not mentioned in any of these records. Partition choices such as this can enhance the level of privacy and security of the data. Each address is associated with a user by the <strong>user_id</strong> foreign key (which references the user table). 

The <b>UNIQUE KEY constraint</b> (placed on user_id, address_line1), ensures that <b>duplicate addressess can not be entered</b> into the system. The foreign key constraint <b>ON-DELETE-CASCADE restriction</b> ensures that <b>if any record is deleted from the user table</b> the corresponding <b>records in user_address will be deleted as well</b>. We will see examples of ON-DELETE-CASCADE triggers throughout this notebook.

In [26]:
%%sql
# 
CREATE TABLE user_address (
    address_id INT PRIMARY KEY AUTO_INCREMENT,  #
    user_id INT,  #  user_address.user_id refers to user.user_id
    is_primary_residence BOOLEAN DEFAULT false,  # 
    address_line1 VARCHAR(100) NOT NULL,  # e.g., 1312 Cherry Basket ln.
    address_line2 VARCHAR(100),  # e.g., Unit 2
    city VARCHAR(40) NOT NULL,  # e.g., Midland
    state VARCHAR(15) NOT NULL,  # e.g., Texas
    postal_code VARCHAR(15) NOT NULL, # e.g., 79701
    country VARCHAR(56),  # e.g., United States
    phone_number VARCHAR(15) NOT NULL, # e.g., (702)579-0585
    
    UNIQUE KEY(user_id, address_line1),
    CONSTRAINT USER_ADDRESS_FK FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE # 
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [27]:
user_addresses = [[1, True, "8447C Airport Street", "Apt#2", "Klamath Falls","OR", "97603", "United States", "(102)479-4505"],
                  [1, False, "255 W. Some Other Rd.", "N/A", "Tampa","FL", "33769", "United States", "(402)455-4599"],
                  [2, True, "328 Saxton St.", "N/A", "Englewood","NJ", "07631", "United States", "(202)484-0535"],
                  [3, True, "8539 W. Olive Court", "N/A", "Bemidji","MN", "56601", "United States", "(502)474-7505"],
                  [3, True, "8546 Laurel Ave.","N/A","Avon Lake", "OH", "44012", "United States", "(102)479-4505"],
                  [4, True, "467 Cooper St.", "N/A", "Ottumwa","IA", "52501", "United States", "(702)579-0585"],
                  [5, True, "9154 Main Court", "N/A", "Latrobe","PA", "15650", "United States", "(702)579-0585"],
                  [5, False, "12 Marshall Street", "N/A", "Galena","MD", "21635", "United States", "(702)579-0585"],
                  [5, False, "2849 Peck Street", "N/A", "Manchester","NH", "03101", "United States", "(702)579-0585"],
                  [6, True, "7019 E. Border Street", "N/A", "Strongsville","Strongsville", "OH", "United States", "(702)579-0585"],
                  [7, True, "819 Aspen Ave.", "N/A", "Maplewood","NJ", "07040", "United States", "(702)579-0585"],
                  [8, True, "admin_08","9216 W. Greenview Ave.", "N/A", "Williamstown","NJ", "08094", "United States", "(502)479-4505"],
                  [9, True, "426 N. Bay Meadows Rd.", "N/A", "Largo","FL", "33771", "United States", "(402)455-4599"],                
                  # This last insert SHOULD fail since that user_id does not exist within user table.
                  # [11,True, "8320 W. Brookside Street","N/A","Streamwood", "IL", "60107", "United States", "(102)479-4505"],
                 ]

In [28]:
insert_user_address = """
INSERT INTO 
    user_address (user_id, is_primary_residence, address_line1, address_line2, city, state, postal_code, country, phone_number)
VALUES
    ("%s","%s","%s","%s","%s","%s","%s","%s","%s");
"""

for user in user_addresses:
    # res = con.execute(insert_user_address, user[0], user[1], user[2], user[3], user[4], user[5], user[6], user[7], user[8])
    try:
        res = con.execute(insert_user_address, user[0], user[1], user[2], user[3], user[4], user[5], user[6], user[7], user[8])
        print("user_id:", user[0], "'s address was inserted successfully.")
    except:
        print("user_id:", user[0], "'s address insertion FAILED.")

user_id: 1 's address was inserted successfully.
user_id: 1 's address was inserted successfully.
user_id: 2 's address was inserted successfully.
user_id: 3 's address was inserted successfully.
user_id: 3 's address was inserted successfully.
user_id: 4 's address was inserted successfully.
user_id: 5 's address was inserted successfully.
user_id: 5 's address was inserted successfully.
user_id: 5 's address was inserted successfully.
user_id: 6 's address was inserted successfully.
user_id: 7 's address was inserted successfully.
user_id: 8 's address was inserted successfully.
user_id: 9 's address was inserted successfully.

<strong>We can use this table to (e.g.) find the number of listed residences for users with two or more registered addresses.</strong>

In [29]:
%%sql
WITH count_address AS (
SELECT user_id, COUNT(user_id) AS 'num_homes'
FROM user_address
GROUP BY user_id
)

SELECT user.user_id AS 'user ID', user.first_name, user.last_name, count_address.num_homes AS 'Number of residences'
FROM user
JOIN count_address
WHERE user.user_id = count_address.user_id and count_address.num_homes >= 2;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
3 rows affected.

[(1, "'Joe'", "'Murr'", 2),
 (3, "'Jen'", "'Jackson'", 2),
 (5, "'Melanie '", "'Baldwin'", 3)]

<b>Again, we will most likely need to access this data when performing search for a specific user, so it makes sense to place a secondary index on user_id</b>.

In [30]:
%%sql
# Makes table joins run faster!
CREATE INDEX USER_RESIDENCE_INDEX  
ON user_address (user_id);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

## The user_payment table
<hr/>
The user_payment table contains credit card information associated with a user by the 'user_id' foreign key. Notice how the user_id artificial key enhances data privacy in this section. Without the users' first and last name, this information is of little use to an unauthorized user, as the remainder of the information is safely hidden in another table.

In [31]:
%%sql
CREATE TABLE user_payment (
    payment_id INT PRIMARY KEY AUTO_INCREMENT,  # good to keep track of payment options.
    user_id INT NOT NULL,  # Foreign key that references user.user_id
    payment_type VARCHAR(40) NOT NULL,  # e.g.,          'DEBIT'            ...     'CREDIT'
    provider VARCHAR(100) NOT NULL,  # e.g., '(WELLS FARGO' | 'CHASE'| ...) ... ('VISA' | 'DISCOVERY' | ...) 
    card_number VARCHAR(20) NOT NULL,
    cvc VARCHAR(10) NOT NULL,  # always 3 numbers
    expiry VARCHAR(10),  # e.g., '2025-07' (cards typically expire the first day of the month.)
    
    UNIQUE KEY(user_id, card_number),
    # CONSTRAINT PAYMENT_TYPE_NO_DUPS UNIQUE(user_id, provider, card_number),  # users can have only one instance of each E-transfer provider, and one instance of each card.
    CONSTRAINT USER_PAYMENT_FK FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

Place a secondary index on user_id, to easily look up their preferred payment option.

In [32]:
%%sql
# rapid look up.
CREATE INDEX USER_PAYMENT_INDEX  
ON user_payment (user_id);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

<strong>We don't want any duplicate credit cards on file. So we can place a non-clustered index on (user_id, card_number) to make sure that this can't happen. Then we insert some test data, including a couple instances of records that we DON'T want to insert into the table.</strong>

In [33]:
user_payment_methods = [[1, "DEBIT", "CHASE", "4485202750970764", "505", "05/2024"],
                        [1, "CREDIT", "VISA", "4485858039365496", "391", "9/2023"], # user can have multiple cards
                        [2, "DEBIT", "VISA", "4539447657840026", "924", "07/2025"], 
                        [2, "CREDIT", "VISA", "4716013835369778", "804", "12/2024"], # 
                        [3, "CREDIT", "VISA", "4556994540374919", "536", "03/2022"],
                        [4, "DEBIT", "VISA", "4929053913134176", "958", "11/2023"],
                        [5, "CREDIT", "DISCOVERY", "4485596057592985", "713", "08/2029"],
                        [6, "CREDIT", "VISA", "4539628822621173", "121", "01/2028"],
                        [7, "CREDIT", "DISCOVERY", "4842467639356646", "548", "02/2026"],
                        [8, "DEBIT", "DISCOVERY", "4485944095819335", "788", "07/2024"],
                        [9, "CREDIT", "VISA", "4532191431974902", "267", "10/2025"],
                        # The user_payment table does not allow duplicate payment information to be entered into the table. 
                        [9, "CREDIT", "VISA", "4532191431974902", "267", "10/2025"],  # FAIL -- duplicate card number
                        [8, "DEBIT", "DISCOVERY", "4485944095819335", "788", "07/2024"]]  # FAIL -- duplicate card number

In [34]:
insert_user_payment = """
INSERT INTO 
    user_payment (user_id, payment_type, provider, card_number, cvc, expiry)
VALUES
    ("%s","%s","%s","%s","%s", "%s");
"""

for payment in user_payment_methods:
    try:
        res = con.execute(insert_user_payment, payment[0], payment[1], payment[2], payment[3], payment[4], payment[5])
        print("SUCCESS! user_id", payment[0], "'s payment info was inserted.")
    except:
        print("FAILED. could not insert user_id", payment[0], "'s payment information.")

SUCCESS! user_id 1 's payment info was inserted.
SUCCESS! user_id 1 's payment info was inserted.
SUCCESS! user_id 2 's payment info was inserted.
SUCCESS! user_id 2 's payment info was inserted.
SUCCESS! user_id 3 's payment info was inserted.
SUCCESS! user_id 4 's payment info was inserted.
SUCCESS! user_id 5 's payment info was inserted.
SUCCESS! user_id 6 's payment info was inserted.
SUCCESS! user_id 7 's payment info was inserted.
SUCCESS! user_id 8 's payment info was inserted.
SUCCESS! user_id 9 's payment info was inserted.
FAILED. could not insert user_id 9 's payment information.
FAILED. could not insert user_id 8 's payment information.

In [35]:
%%sql
select * from user_payment
order by user_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
11 rows affected.

[(1, 1, "'DEBIT'", "'CHASE'", "'4485202750970764'", "'505'", "'05/2024'"),
 (2, 1, "'CREDIT'", "'VISA'", "'4485858039365496'", "'391'", "'9/2023'"),
 (3, 2, "'DEBIT'", "'VISA'", "'4539447657840026'", "'924'", "'07/2025'"),
 (4, 2, "'CREDIT'", "'VISA'", "'4716013835369778'", "'804'", "'12/2024'"),
 (5, 3, "'CREDIT'", "'VISA'", "'4556994540374919'", "'536'", "'03/2022'"),
 (6, 4, "'DEBIT'", "'VISA'", "'4929053913134176'", "'958'", "'11/2023'"),
 (7, 5, "'CREDIT'", "'DISCOVERY'", "'4485596057592985'", "'713'", "'08/2029'"),
 (8, 6, "'CREDIT'", "'VISA'", "'4539628822621173'", "'121'", "'01/2028'"),
 (9, 7, "'CREDIT'", "'DISCOVERY'", "'4842467639356646'", "'548'", "'02/2026'"),
 (10, 8, "'DEBIT'", "'DISCOVERY'", "'4485944095819335'", "'788'", "'07/2024'"),
 (11, 9, "'CREDIT'", "'VISA'", "'4532191431974902'", "'267'", "'10/2025'")]

<strong>A credit card company is offering a special prize to company employees who shop at our site using their credit card brand. Find the first name, last name, email, and job title (i.e., admin_type) of employees with a DISCOVERY credit card on file.</strong>

In [36]:
%%sql
# Use Common Table Expressions.
WITH admin_users AS (
    SELECT 
        adminuser.user_id AS 'user_id', user.first_name AS 'first_name', user.last_name AS 'last_name', adminuser.admin_type AS 'admin_type', 
            user.email AS 'email' 
    FROM 
        adminuser
    INNER JOIN
        user
    ON
        adminuser.user_id = user.user_id
)
SELECT * 
FROM admin_users
JOIN user_payment
ON admin_users.user_id = user_payment.user_id
WHERE user_payment.payment_type LIKE '\'%CREDIT\'' AND user_payment.provider LIKE '\'%DISCOVERY\'';

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.

[(7, "'Malik '", "'Coleman'", "'Requisitioner'", "'admin_07_@email.com'", 9, 7, "'CREDIT'", "'DISCOVERY'", "'4842467639356646'", "'548'", "'02/2026'")]

Malik Coleman, you're a <b>winner!</b>

<h1>Products</h1>
<hr/>

<h3>'product', 'product_inventory', 'product_category', and 'product_discount' tables</h3>

The <b>E/R relationship</b> between <b>'product'</b> and <b>'product_inventory'</b> is <b>1-1(1)</b>, mandatory. (open arrow dependency)
<br>The <b>E/R relationship</b> between <b>'product'</b> and <b>'product_category'</b> is <b>1-1(0)</b>, optional.
<br>The <b>E/R relationship</b> between <b>'product'</b> and <b>'product_discount'</b> is also <b>1-1(0)</b>, optional.

In [37]:
%%sql
CREATE TABLE product_category (
    category_id INT PRIMARY KEY AUTO_INCREMENT,  # This PK is referenced by product.category_id
    category_name VARCHAR(50) UNIQUE NOT NULL,  # 
    category_desc VARCHAR(400),  #
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,  # 
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    UNIQUE KEY(category_name, category_desc)  # no duplicate categories.
);  
# Products belong to a product category, but the category can change, and even be NULL (product still exists if category is deleted).

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.
0 rows affected.

[]

In [38]:
# category_id is NOT auto-increment. Product categories is in many ways, already an index.
product_categories = [["outdoor_gear", "Camping, Fishing, and Hiking gear."],
                      ["mens_clothing", "The latest fashions in menswear."],
                      ["mens_shoes", "Find a great fit."],
                      ["womens_clothing", "Seasonal fashions, clearance prices."],
                      ["womens_shoes", "We know shoes."],
                      ["garden_supplies", "Lawn, garden, and landscaping supplies."],
                      ["sports_equipment", "Soccer, footbal, basketball, baseball and more."],
                      ["electronics", "Top tech gadgets."],
                      ["grocery", "Fresh produce, dairy, Deli and more."],
                      ["automotive", "Oil, tire, and car care products."]
                     ]

<strong> Run the following cell twice to see the product_category table prevent duplicate category names from entering the database. </strong>

In [39]:
insert_product_categories = """
INSERT INTO 
    product_category (category_name, category_desc)
VALUES
    ("%s","%s");
"""

for category in product_categories:
    try:
        res = con.execute(insert_product_categories, category[0], category[1])
        print("SUCCESS! category_id", category[0], "was inserted into 'product_category'")
    except:
        print("FAILED. Could not insert category_id", category[0], "into 'product_category'")

SUCCESS! category_id outdoor_gear was inserted into 'product_category'
SUCCESS! category_id mens_clothing was inserted into 'product_category'
SUCCESS! category_id mens_shoes was inserted into 'product_category'
SUCCESS! category_id womens_clothing was inserted into 'product_category'
SUCCESS! category_id womens_shoes was inserted into 'product_category'
SUCCESS! category_id garden_supplies was inserted into 'product_category'
SUCCESS! category_id sports_equipment was inserted into 'product_category'
SUCCESS! category_id electronics was inserted into 'product_category'
SUCCESS! category_id grocery was inserted into 'product_category'
SUCCESS! category_id automotive was inserted into 'product_category'

In [40]:
%%sql
SELECT * FROM product_category;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
10 rows affected.

[(1, "'outdoor_gear'", "'Camping, Fishing, and Hiking gear.'", datetime.datetime(2023, 5, 4, 4, 12, 2), datetime.datetime(2023, 5, 4, 4, 12, 2)),
 (2, "'mens_clothing'", "'The latest fashions in menswear.'", datetime.datetime(2023, 5, 4, 4, 12, 2), datetime.datetime(2023, 5, 4, 4, 12, 2)),
 (3, "'mens_shoes'", "'Find a great fit.'", datetime.datetime(2023, 5, 4, 4, 12, 2), datetime.datetime(2023, 5, 4, 4, 12, 2)),
 (4, "'womens_clothing'", "'Seasonal fashions, clearance prices.'", datetime.datetime(2023, 5, 4, 4, 12, 2), datetime.datetime(2023, 5, 4, 4, 12, 2)),
 (5, "'womens_shoes'", "'We know shoes.'", datetime.datetime(2023, 5, 4, 4, 12, 2), datetime.datetime(2023, 5, 4, 4, 12, 2)),
 (6, "'garden_supplies'", "'Lawn, garden, and landscaping supplies.'", datetime.datetime(2023, 5, 4, 4, 12, 2), datetime.datetime(2023, 5, 4, 4, 12, 2)),
 (7, "'sports_equipment'", "'Soccer, footbal, basketball, baseball and more.'", datetime.datetime(2023, 5, 4, 4, 12, 2), datetime.datetime(2023, 5, 4, 4, 12, 2)),
 (8, "'electronics'", "'Top tech gadgets.'", datetime.datetime(2023, 5, 4, 4, 12, 2), datetime.datetime(2023, 5, 4, 4, 12, 2)),
 (9, "'grocery'", "'Fresh produce, dairy, Deli and more.'", datetime.datetime(2023, 5, 4, 4, 12, 2), datetime.datetime(2023, 5, 4, 4, 12, 2)),
 (10, "'automotive'", "'Oil, tire, and car care products.'", datetime.datetime(2023, 5, 4, 4, 12, 2), datetime.datetime(2023, 5, 4, 4, 12, 2))]

## The 'product' table
<hr/>

The category_id attribute is a foreign key that referencing a record in the product_category table. Since a product exists whether it belongs to a category or not, we place an "on-delete-cascade" trigger on the attribute to set category_id=NULL when the category is deleted.

In [41]:
%%sql
CREATE TABLE product (
    product_id INT PRIMARY KEY AUTO_INCREMENT,  # TIER INDEX KEY
    category_id INT,  # FK for product_category.category_id. Product belongs to a product category. (ON DELETE, SET NULL)
    product_name VARCHAR(100),
    product_desc VARCHAR(400), 
    sku VARCHAR(15) UNIQUE, 
    price DECIMAL(13, 2),  # price must be kept as a decimal for computing discounts
    rating DECIMAL(2, 1),  # products need a rating.
    
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    # If the category is deleted then all we have is a product without a category. => '...ON DELETE SET NULL'
    CONSTRAINT PRODUCT_CATEGORY_FK FOREIGN KEY (category_id) REFERENCES product_category(category_id) ON DELETE SET NULL
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

Because there is no rule against two vendors selling the same product, each item is distinguished with a <b>unique SKU</b> (constraint).<br>
<strong> Example SKU: 'XXX-YYY-ZZZ'<br>
'XXX' = chronologic index of the products list of the selling vendor (not the same as product_id).<br>
'YYY' = three letter abbreviation of the product category, "N_A" if product category is NULL.<br>
'ZZZ' = vendor ID.</strong>

In [42]:
product_list = [[1, "Outdoor Recliner", "Fold-up canvas camping chair.", "001-OUT-001", 199.99, 4.2],
                [2, "Men's Hooded Fleece", "Soft, warm and comfy men's outer garment.", "001-MNC-003", 119.99, 3.9],
                [3, "Casual Loafers", "Casual mens footwear.", "001-MNS-001", 59.99, 4.5],
                [3, "Running Shoes", "Comfortable running shoes.", "001-MNS-002", 99.99, 5.0],
                [3, "Work Boots", "Comfortable and durable mens work boots.", "001-MNS-003", 199.99, 4.0],
                [3, "Sandals", "Mens sandals.", "001-MNS-004", 39.99, 4.3],
                [3, "House Slippers", "Comfortable mens house slippers.", "001-MNS-005", 49.99, 4.7],
                [4, "Women's Scarf", "Fashionable women's scarf.", "001-WMC-002", 34.99, 2.8],
                [5, "Women's Slip-Ons", "Cozy women's slip-ons.", "001-WMS-002", 44.99, 4.5],
                [6, "Cloth Planter Pots", "Cloth planter for fruits and veggetables.", "001-GSP-002", 10.99, 4.6],
                [7, "Men's Basketball", "Top-shelf men's basketball.", "001-SPT-003", 59.99, 4.7],
                [8, "Iphone28", "The latest Iphone technology.", "001-ELC-004", 999.99, 2.0],
                [9, "Fresh Bagels", "Fresh bagels, delivered from our a bakery.", "001-GRO-005", 6.99, 1.9],
                [10, "Air Freshener", "Clip on vent air freshener.", "001-AUT-001", 6.99, 5.0],
                [7, "Duplicate SKU", "Duplicate SKU test.", "001-AUT-001", 6.99, 4.1],  # Duplicate SKU, should FAIL.
                [7, "Duplicate SKU", "Duplicate SKU test.", "001-GRO-005", 6.99, 3.5],  # Duplicate SKU, should FAIL.
               ]

Now we can insert products into the product table. Two of these records <b>contain duplicate SKUs</b>, inserting these records <b>should fail</b> if the <B>UNIQUE constraint</b> is set.

In [43]:
insert_products = """
INSERT INTO 
    product (category_id, product_name, product_desc, sku, price, rating)
VALUES
    ("%s","%s","%s","%s","%s","%s");
"""

for product in product_list:
    try:
        res = con.execute(insert_products, product[0], product[1], product[2], product[3], product[4], product[5])
        print("SUCCESS! inserted product:", "'" + product[1] + "'|", "SKU:", product[3])
    except:
        print("FAILED. Could not insert product:", "'" + product[1] + "'|", "SKU:", product[3])

SUCCESS! inserted product: 'Outdoor Recliner'| SKU: 001-OUT-001
SUCCESS! inserted product: 'Men's Hooded Fleece'| SKU: 001-MNC-003
SUCCESS! inserted product: 'Casual Loafers'| SKU: 001-MNS-001
SUCCESS! inserted product: 'Running Shoes'| SKU: 001-MNS-002
SUCCESS! inserted product: 'Work Boots'| SKU: 001-MNS-003
SUCCESS! inserted product: 'Sandals'| SKU: 001-MNS-004
SUCCESS! inserted product: 'House Slippers'| SKU: 001-MNS-005
SUCCESS! inserted product: 'Women's Scarf'| SKU: 001-WMC-002
SUCCESS! inserted product: 'Women's Slip-Ons'| SKU: 001-WMS-002
SUCCESS! inserted product: 'Cloth Planter Pots'| SKU: 001-GSP-002
SUCCESS! inserted product: 'Men's Basketball'| SKU: 001-SPT-003
SUCCESS! inserted product: 'Iphone28'| SKU: 001-ELC-004
SUCCESS! inserted product: 'Fresh Bagels'| SKU: 001-GRO-005
SUCCESS! inserted product: 'Air Freshener'| SKU: 001-AUT-001
FAILED. Could not insert product: 'Duplicate SKU'| SKU: 001-AUT-001
FAILED. Could not insert product: 'Duplicate SKU'| SKU: 001-GRO-005

In [44]:
%%sql
SELECT * FROM product;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
14 rows affected.

[(1, 1, "'Outdoor Recliner'", "'Fold-up canvas camping chair.'", "'001-OUT-001'", Decimal('199.99'), Decimal('4.2'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (2, 2, "'Men's Hooded Fleece'", "'Soft, warm and comfy men's outer garment.'", "'001-MNC-003'", Decimal('119.99'), Decimal('3.9'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (3, 3, "'Casual Loafers'", "'Casual mens footwear.'", "'001-MNS-001'", Decimal('59.99'), Decimal('4.5'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (4, 3, "'Running Shoes'", "'Comfortable running shoes.'", "'001-MNS-002'", Decimal('99.99'), Decimal('5.0'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (5, 3, "'Work Boots'", "'Comfortable and durable mens work boots.'", "'001-MNS-003'", Decimal('199.99'), Decimal('4.0'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (6, 3, "'Sandals'", "'Mens sandals.'", "'001-MNS-004'", Decimal('39.99'), Decimal('4.3'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (7, 3, "'House Slippers'", "'Comfortable mens house slippers.'", "'001-MNS-005'", Decimal('49.99'), Decimal('4.7'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (8, 4, "'Women's Scarf'", "'Fashionable women's scarf.'", "'001-WMC-002'", Decimal('34.99'), Decimal('2.8'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (9, 5, "'Women's Slip-Ons'", "'Cozy women's slip-ons.'", "'001-WMS-002'", Decimal('44.99'), Decimal('4.5'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (10, 6, "'Cloth Planter Pots'", "'Cloth planter for fruits and veggetables.'", "'001-GSP-002'", Decimal('10.99'), Decimal('4.6'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (11, 7, "'Men's Basketball'", "'Top-shelf men's basketball.'", "'001-SPT-003'", Decimal('59.99'), Decimal('4.7'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (12, 8, "'Iphone28'", "'The latest Iphone technology.'", "'001-ELC-004'", Decimal('999.99'), Decimal('2.0'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (13, 9, "'Fresh Bagels'", "'Fresh bagels, delivered from our a bakery.'", "'001-GRO-005'", Decimal('6.99'), Decimal('1.9'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 (14, 10, "'Air Freshener'", "'Clip on vent air freshener.'", "'001-AUT-001'", Decimal('6.99'), Decimal('5.0'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4))]

<strong>Note:</strong> SKUs (pronounced "skews" or "S-K-U") are the primary product tracing mechanism for many businesses.

The <b>ON-DELETE-SET-NULL constraint</b> should <b>change any reference to the deleted product category to "None"</b>. We will <b>delete product_id 10</b> and then take a look at the product table.

In [45]:
%%sql
DELETE FROM product_category WHERE category_id = 10;
SELECT * FROM product
WHERE product_id = 14;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.
1 rows affected.

[(14, None, "'Air Freshener'", "'Clip on vent air freshener.'", "'001-AUT-001'", Decimal('6.99'), Decimal('5.0'), datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4))]

<h3>Product Catalog</h3>
We now have everything that we need to <b>create a basic product catalog</b>. Alternatively sorted variations of this catalog can be created by modifying the <b>category name</b> and the <b>ORDER BY attribute</b>, to filter the search results based according to a user's preference (by cost, for example). The query below sorts products in the "mens_shoes" category by rating, and lists them in descending order. We are free to turn these variations into independent views if we like, or enable the user to construct search queries of their own.

In [47]:
%%sql 
WITH product_catalog AS (
SELECT
    product.product_name AS 'Name',  product.product_desc AS 'Description', product_category.category_name AS 'Category',  
        product.price AS 'Price', product.rating AS 'Rating', product.sku AS 'SKU', product.created_at AS 'created_at', product.modified_at AS 'modified_at'
FROM
    product_category
INNER JOIN
    product
ON
    product.category_id = product_category.category_id
)

SELECT * FROM product_catalog
WHERE Category LIKE '\'%mens_shoes\''  # CHANGE THIS, (AND/OR)
ORDER BY product_catalog.Rating DESC;   # CHANGE THIS

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
6 rows affected.

[("'Running Shoes'", "'Comfortable running shoes.'", "'mens_shoes'", Decimal('99.99'), Decimal('5.0'), "'001-MNS-002'", datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 ("'House Slippers'", "'Comfortable mens house slippers.'", "'mens_shoes'", Decimal('49.99'), Decimal('4.7'), "'001-MNS-005'", datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 ("'Casual Loafers'", "'Casual mens footwear.'", "'mens_shoes'", Decimal('59.99'), Decimal('4.5'), "'001-MNS-001'", datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 ("'Women's Slip-Ons'", "'Cozy women's slip-ons.'", "'womens_shoes'", Decimal('44.99'), Decimal('4.5'), "'001-WMS-002'", datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 ("'Sandals'", "'Mens sandals.'", "'mens_shoes'", Decimal('39.99'), Decimal('4.3'), "'001-MNS-004'", datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4)),
 ("'Work Boots'", "'Comfortable and durable mens work boots.'", "'mens_shoes'", Decimal('199.99'), Decimal('4.0'), "'001-MNS-003'", datetime.datetime(2023, 5, 4, 4, 12, 4), datetime.datetime(2023, 5, 4, 4, 12, 4))]

## The product_inventory table
<hr/>

<strong>Before a product_inventory record can exist, a corresponding product_id must exist in the product table.</strong> I.e., a product must exist to have a product_inventory.
<br><br>
This <b><u>referential integrity constraint</u></b> is enforced with an <b>"on-delete-cascade" trigger</b> placed on <b>product_id</b>. We also place <b>restrictions on the 'qty' attribute</b> to <b>prevent undefined behavior from negative and/or extremely large integer values</b>. We will test the trigger by <b>deleting an item from product</b> and checking if it <b>exists in product_inventory</b>.

In [48]:
%%sql
CREATE TABLE product_inventory (  # product_id is a primary AND a foreign key. 
    product_id INT PRIMARY KEY,  # Each product has one inventory; each inventory refers to one product. 1-1(1).
    sku VARCHAR(15) UNIQUE, # SKU is unique and can be accessed at any time.
    qty INT,  # the quantity of the item currently in stock.
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    CONSTRAINT POSITIVE_INVENTORY CHECK(qty >= 0 and qty < 2147483647),  # inventory must be positive.
    CONSTRAINT PRODUCT_INVENTORY FOREIGN KEY (product_id) REFERENCES product(product_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [49]:
inventory = [[1, "001-OUT-001", 500],
             [2, "001-MNC-003", 350],
             [3, "001-MNS-001", 1200],
             [4, "001-MNS-002", 50],
             [5, "001-MNS-003", 14],
             [6, "001-MNS-004", 120],
             [7, "001-MNS-005", 45],
             [8, "001-WMC-002", 1],
             [9, "001-WMS-002", 20],
             [10, "001-GSP-002", 200],
             [11, "001-SPT-003", 200],
             [12, "001-ELC-004", 200],
             [13, "001-GRO-005", 200],
             [14, "001-AUT-001", 200]
            ]

In [50]:
insert_inventory = """
INSERT INTO 
    product_inventory (product_id, sku, qty)
VALUES
    ("%s","%s","%s");
"""

for item in inventory:
    # res = con.execute(insert_inventory, item[0], item[1], item[2])
    try:
        res = con.execute(insert_inventory, item[0], item[1], item[2])
        print("SUCCESS! Inserted inventory for product #:", item[0], ",", "SKU:", item[1])
    except:
        print("FAILED to insert inventory for product #:", item[0], ",", "SKU:", item[1])

SUCCESS! Inserted inventory for product #: 1 , SKU: 001-OUT-001
SUCCESS! Inserted inventory for product #: 2 , SKU: 001-MNC-003
SUCCESS! Inserted inventory for product #: 3 , SKU: 001-MNS-001
SUCCESS! Inserted inventory for product #: 4 , SKU: 001-MNS-002
SUCCESS! Inserted inventory for product #: 5 , SKU: 001-MNS-003
SUCCESS! Inserted inventory for product #: 6 , SKU: 001-MNS-004
SUCCESS! Inserted inventory for product #: 7 , SKU: 001-MNS-005
SUCCESS! Inserted inventory for product #: 8 , SKU: 001-WMC-002
SUCCESS! Inserted inventory for product #: 9 , SKU: 001-WMS-002
SUCCESS! Inserted inventory for product #: 10 , SKU: 001-GSP-002
SUCCESS! Inserted inventory for product #: 11 , SKU: 001-SPT-003
SUCCESS! Inserted inventory for product #: 12 , SKU: 001-ELC-004
SUCCESS! Inserted inventory for product #: 13 , SKU: 001-GRO-005
SUCCESS! Inserted inventory for product #: 14 , SKU: 001-AUT-001

In [51]:
%%sql
SELECT * FROM product_inventory LIMIT 8;  # take a look at the product_inventory table

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
8 rows affected.

[(1, "'001-OUT-001'", 500, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (2, "'001-MNC-003'", 350, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (3, "'001-MNS-001'", 1200, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (4, "'001-MNS-002'", 50, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (5, "'001-MNS-003'", 14, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (6, "'001-MNS-004'", 120, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (7, "'001-MNS-005'", 45, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (8, "'001-WMC-002'", 1, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16))]

We will now test the trigger by <b>deleting item 7 from the product table</b> and checking if it still <b>exists in product_inventory</b>.

In [52]:
%%sql
DELETE FROM product WHERE product_id = 7;  # DELETE product_id #7 from the product table

SELECT * FROM product_inventory LIMIT 8;  # check product_inventory again.

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.
8 rows affected.

[(1, "'001-OUT-001'", 500, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (2, "'001-MNC-003'", 350, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (3, "'001-MNS-001'", 1200, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (4, "'001-MNS-002'", 50, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (5, "'001-MNS-003'", 14, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (6, "'001-MNS-004'", 120, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (8, "'001-WMC-002'", 1, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16)),
 (9, "'001-WMS-002'", 20, datetime.datetime(2023, 5, 4, 4, 12, 16), datetime.datetime(2023, 5, 4, 4, 12, 16))]

<strong>It appears the ON-DELETE-CASCADE trigger is working properly.</strong>

## The product_discount table
<hr/>

<b>Only one discount can be applied to a product at a time.</b> Discount data is stored in a table by itself, a record in this table may/may not refer to a product in the system. Therefore product_discount is optional, and its records depend on the product table.

In [53]:
%%sql
CREATE TABLE product_discount (
    discount_id INT PRIMARY KEY AUTO_INCREMENT,  # integer primary key, auto-increment.
    product_id INT,  # references product.product_id
    discount_name VARCHAR(40),  # example: 'July 4th Flash Sale'
    discount_percent DECIMAL(5,2),  # a discount percentage rate
    discount_desc VARCHAR(200),  # example: "In honor of independence day, all our T-shirts are 50% off!"
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    # Without a product, there is no product discount.
    CONSTRAINT PRODUCT_SUPPORTS_DISCOUNT FOREIGN KEY (product_id) REFERENCES product(product_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [54]:
discounts = [[2, "discount_2", 0.15, "15% Discount"],
             [3, "discount_3", 0.30, "30% Discount"],
             [5, "discount_5", 0.05, "5% Discount"],
             [6, "discount_6", 0.10, "10% Discount"],
             [7, "discount_7", 0.20, "20% Discount"],  # 7 should fail (deleted from the product tbl earlier).
             [8, "discount_8", 0.15, "15% Discount"],
             [11, "discount_11", 0.25, "25% Discount"],
             [12, "discount_12", 0.40, "40% Discount"],
             [14, "discount_14", 0.20, "20% Discount"]
            ]

In [55]:
insert_discounts = """
INSERT INTO 
    product_discount (product_id, discount_name, discount_percent, discount_desc)
VALUES
    ("%s","%s","%s","%s");
"""

for item in discounts:
    # res = con.execute(insert_inventory, item[0], item[1], item[2], item[3])
    try:
        res = con.execute(insert_discounts, item[0], item[1], item[2], item[3])
        print("SUCCESS! Inserted:", item[1])
    except:
        print("FAILED to insert:", item[1])

SUCCESS! Inserted: discount_2
SUCCESS! Inserted: discount_3
SUCCESS! Inserted: discount_5
SUCCESS! Inserted: discount_6
FAILED to insert: discount_7
SUCCESS! Inserted: discount_8
SUCCESS! Inserted: discount_11
SUCCESS! Inserted: discount_12
SUCCESS! Inserted: discount_14

<h3>Now we can view a table including the discounted products.</h3>

In [56]:
%%sql
SELECT  product.product_id AS 'product_id',
        product.product_name AS 'product_name', 
        product.price AS 'original_price', 
        product_discount.discount_percent AS 'discount_percent', 
        ROUND(product.price - (product.price*product_discount.discount_percent),2) AS 'discounted_price',
        product_discount.discount_desc AS 'discount_description'
        
FROM product
LEFT JOIN product_discount
ON product.product_id = product_discount.product_id

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
13 rows affected.

[(1, "'Outdoor Recliner'", Decimal('199.99'), None, None, None),
 (2, "'Men's Hooded Fleece'", Decimal('119.99'), Decimal('0.15'), Decimal('101.99'), "'15% Discount'"),
 (3, "'Casual Loafers'", Decimal('59.99'), Decimal('0.30'), Decimal('41.99'), "'30% Discount'"),
 (4, "'Running Shoes'", Decimal('99.99'), None, None, None),
 (5, "'Work Boots'", Decimal('199.99'), Decimal('0.05'), Decimal('189.99'), "'5% Discount'"),
 (6, "'Sandals'", Decimal('39.99'), Decimal('0.10'), Decimal('35.99'), "'10% Discount'"),
 (8, "'Women's Scarf'", Decimal('34.99'), Decimal('0.15'), Decimal('29.74'), "'15% Discount'"),
 (9, "'Women's Slip-Ons'", Decimal('44.99'), None, None, None),
 (10, "'Cloth Planter Pots'", Decimal('10.99'), None, None, None),
 (11, "'Men's Basketball'", Decimal('59.99'), Decimal('0.25'), Decimal('44.99'), "'25% Discount'"),
 (12, "'Iphone28'", Decimal('999.99'), Decimal('0.40'), Decimal('599.99'), "'40% Discount'"),
 (13, "'Fresh Bagels'", Decimal('6.99'), None, None, None),
 (14, "'Air Freshener'", Decimal('6.99'), Decimal('0.20'), Decimal('5.59'), "'20% Discount'")]

<h1>Shopping Tier</h1>
<hr>

This section integrates data from the user and product tables, using triggers to present the abstraction of a user shopping cart by defining the relationship between strong entities.

The first order of business is to implement the transient tables <b>'cart_item'</b> and <b>'cart_session'</b> to support the shopping process.

<h3><u>The 'cart_session' Table</u></h3>

In [58]:
%%sql
# a cart belongs to a single user
CREATE TABLE cart_session (
    cart_id INT PRIMARY KEY AUTO_INCREMENT,
    user_id INT UNIQUE,  # Only one cart_session at a time per user.
    cart_total DECIMAL(10,2),
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    CONSTRAINT CART_PRODUCT_FK FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

<h3><u>The 'cart_item' Table</u></h3>

We place the <b>on-delete-cascade</b> constraints on the foreign keys <b>"cart_id"</b> and <b>"product_id"</b>, since a cart item cannot exist without each of these supporting types. We declare (cart_id, product_id) as a UNIQUE combined key to ensure that cart_item record are not uncontrollably replicated.

In [59]:
%%sql
# cart items belong to a cart
CREATE TABLE cart_item (
    cart_item_id INT PRIMARY KEY AUTO_INCREMENT,
    cart_id INT,   # Supporting type #1
    product_id INT,  # Supporting type #2
    item_qty INT,  # Number of cart_items units added to the cart
    unit_price DECIMAL(13,2),  # Unit price of cart_item
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    UNIQUE KEY(cart_id, product_id),
    
    CONSTRAINT CART_ITEM_FK1 FOREIGN KEY (cart_id) REFERENCES cart_session(cart_id) ON DELETE CASCADE,
    CONSTRAINT CART_ITEM_FK2 FOREIGN KEY (product_id) REFERENCES product(product_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

Joe Murr is getting ready for a father-son fishing trip. He creates a new shopping cart whenever he browses products.

In [60]:
user_id = 1  # Joe Murr
create_cart_session = """
INSERT INTO 
    cart_session (user_id, cart_total)
VALUES
    ("%s",0.00);
"""
try:
    res = con.execute(create_cart_session, user_id)
    print("Created a cart_session for user_id:", user_id)
except:
    print("FAILED to insert:", user_id)

Created a cart_session for user_id: 1

We can easily join the cart_session records with user table records to see information about the status of a shopping session.

In [61]:
%%sql
SELECT user.user_id, cart_session.cart_id, cart_session.cart_total, first_name, last_name, email 
FROM user
JOIN cart_session
ON cart_session.user_id = user.user_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.

[(1, 1, Decimal('0.00'), "'Joe'", "'Murr'", "'user_01_@email.com'")]

<strong>cart_item ON-INSERT-UPDATE cart_session trigger</strong>

An <b>on-insert-update trigger</b> is placed on the <b>cart_item table</b>, so that inserting an item increases the value of <b>cart_total</b> by an amount equal to the product price, multiplied by the product quantity.

In [62]:
%%sql
DROP TRIGGER IF EXISTS `increase_total`;

CREATE TRIGGER increase_total AFTER INSERT ON cart_item
    FOR EACH ROW UPDATE cart_session
        SET cart_total = (cart_total + (new.item_qty*new.unit_price))
        WHERE cart_session.cart_id = new.cart_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.
0 rows affected.

[]

<strong>cart_item BEFORE-UPDATE-SET trigger</strong>
<br>Now we need a trigger to <b>reset cart_total</b> whenever <b>cart_item.qty is adjusted</b>.

In [63]:
%%sql
DROP TRIGGER IF EXISTS `update_total`;
CREATE TRIGGER update_total BEFORE UPDATE ON cart_item
    FOR EACH ROW UPDATE cart_session
        SET cart_total = ((cart_total - (old.item_qty*old.unit_price)) + (new.item_qty*new.unit_price))
        WHERE cart_session.cart_id = new.cart_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.
0 rows affected.

[]

In [64]:
# 'Outdoor Recliner'	1	199.99	0.15	169.99	'15% Discount'  (x5)
# 'Men's Hooded Fleece'	2	119.99	0.15	101.99	'15% Discount'  (X2)
cart_item = [[1, 4, 5, 74.99], 
             [1, 2, 2, 101.99]]

In [65]:
insert_cart_items = """
INSERT INTO 
    cart_item (cart_id, product_id, item_qty, unit_price)
VALUES
    ("%s","%s","%s","%s");
"""
# res = con.execute(insert_cart_items, cart_item)
for item in cart_item:
    try:
        res = con.execute(insert_cart_items, item[0], item[1], item[2], item[3])
        print("SUCCESS! Created a cart_item insert with qty:", item[2], "for product_id:", item[1])
    except:
        print("FAILED to insert product_id:", item[1])

SUCCESS! Created a cart_item insert with qty: 5 for product_id: 4
SUCCESS! Created a cart_item insert with qty: 2 for product_id: 2

In [66]:
%%sql
WITH filled_cart AS (
SELECT cart_session.cart_id, cart_session.user_id, cart_item.cart_item_id, cart_item.item_qty, cart_item.unit_price, cart_session.cart_total
FROM cart_session
JOIN cart_item
ON cart_session.cart_id = cart_item.cart_id
),
user_cart AS (
SELECT filled_cart.cart_id, filled_cart.user_id, user.first_name, user.last_name, filled_cart.cart_item_id, filled_cart.item_qty, filled_cart.unit_price, filled_cart.cart_total
FROM filled_cart
JOIN user
ON filled_cart.user_id = user.user_id
)

SELECT user_cart.cart_id, product.product_name, product.product_desc, user_cart.item_qty, user_cart.unit_price, user_cart.cart_total
FROM user_cart
JOIN product
ON user_cart.cart_item_id = product.product_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
2 rows affected.

[(1, "'Outdoor Recliner'", "'Fold-up canvas camping chair.'", 5, Decimal('74.99'), Decimal('578.93')),
 (1, "'Men's Hooded Fleece'", "'Soft, warm and comfy men's outer garment.'", 2, Decimal('101.99'), Decimal('578.93'))]

<strong>Joe only needs 4 camping chairs...</strong>
Let's see if the trigger computes <b>quantity</b> and <b>cart_total</b> correctly. We change item_qty with an update-set-where clause, and then rerun the ctes in the cell above.

In [67]:
change_qty =""" 
            UPDATE 
                cart_item 
            SET 
                item_qty = "%s"
            WHERE 
                cart_id = "%s" and product_id = "%s";
            """
item_update = [4, 1, 4]
res = con.execute(change_qty, item_update[0], item_update[1], item_update[2])

<h3>Now run the cell with the ctes again to find out if the trigger works!</h3>
Sure does!

<h2><strong>End of the Shopping Tier</strong></h2>

<h1>The Order Handling Tier</h1>
<hr>

The <b>order handling tier</b> creates, stores, and maintains <b>records describing a users purchase</b>. The first tables to create are <b>order_item</b> and <b>order</b>.

In [68]:
%%sql
# a cart belongs to a single user
CREATE TABLE order_details (
    order_id INT PRIMARY KEY AUTO_INCREMENT,
    user_id INT,  # Only one cart_session at a time per user.
    cart_id INT UNIQUE,  # Foreign key, references cart_session.cart_id
    payment_id INT,  # primary key of the user's payment method
    address_id INT,
    order_total DECIMAL(10,2),  # order total
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    UNIQUE KEY(user_id, cart_id),
    
    CONSTRAINT ORDER_USER_FK FOREIGN KEY (user_id) REFERENCES user(user_id),
    CONSTRAINT ORDER_CART_FK FOREIGN KEY (cart_id) REFERENCES cart_session(cart_id),
    CONSTRAINT ORDER_PAYMENT_FK FOREIGN KEY (payment_id) REFERENCES user_payment(payment_id),
    CONSTRAINT ORDER_ADDRESS_FK FOREIGN KEY (address_id) REFERENCES user_address(address_id)
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

Assume the following order is entered into the system.

In [69]:
customer_order = [1,1,1,1,503.94]  # Joe Murr has placed an order.
place_order = """
INSERT INTO 
    order_details (user_id, cart_id, payment_id, address_id, order_total)
VALUES
    ("%s","%s","%s","%s","%s");
"""
# res = con.execute(place_order, customer_order[0], customer_order[1], customer_order[2], customer_order[3], customer_order[4])
try:
    res = con.execute(place_order, customer_order[0], customer_order[1], customer_order[2], customer_order[3], customer_order[4]) 
    print("SUCCESS! Processed payment for customer_id:", customer_order[0], "for product_id:", customer_order[1])
except:
    print("FAILED could not complete the transaction.")

SUCCESS! Processed payment for customer_id: 1 for product_id: 1

<h4>Wahoo, our first sale!</h4>
The SFW statement below shows a record that containing a set of foreign keys that can be used to collect information related to the sale. With these PK values in hand, we can select from dozens of attributes from tables accross the entire database.

In [70]:
%%sql
SELECT * FROM order_details;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.

[(1, 1, 1, 1, 1, Decimal('503.94'), datetime.datetime(2023, 5, 4, 4, 12, 46), datetime.datetime(2023, 5, 4, 4, 12, 46))]

We also need to update the inventory for each product list. 
<br>
While we can probably do this with triggers, it is much less complicated to use python. An adaptation of this function could be written to a server (for example). 
<br>
NOTE: this function should only be called once!

In [71]:
# The first function collects all cart_items mentioned in orders and returns the product_id and item_qty for that item.
product_qty = """
SELECT product_id, item_qty
FROM cart_item, order_details
WHERE cart_item.cart_id = order_details.cart_id;
"""
res = list(con.execute(product_qty))  # list of projected tuples satisfying the condition.
print(res)

# Then, the second function accepts values collected from the first expression and uses them to perform an update query 
# on the product_inventory table for the items included in an order.
update_inventory = """
UPDATE product_inventory
SET
    qty = qty - "%s"
WHERE
    product_inventory.product_id = "%s";
"""
for qty in res:
    try:
        res = con.execute(update_inventory, qty[1], qty[0])
        print("Successfully updated inventory for product_id:", qty[0])
    except:
        print("Failed to update inventory for product_id:", qty[0])#

[(4, 4), (2, 2)]
Successfully updated inventory for product_id: 4
Successfully updated inventory for product_id: 2

<h3>Let's generate a sales reciept using some ctes.</h3>

We can tie in an extensive amount of data from the integer foreign keys presented in the sales record.
<br>
This includes <b>user address/payment information</b>, <b>product information</b>, and just about <b>anything else we would like to know about the sale</b>.
<br>
Let's summarize Joe's purchase by pulling information from each of the tables referenced by the foreign keys listed in the order record.

In [72]:
%%sql
WITH purchase_items AS (  # first we will locate the cart_items involved in the purchase.
    SELECT cart_item.cart_id, cart_item.product_id, cart_item.unit_price, cart_item.item_qty, order_details.created_at AS 'purchased_at', order_details.order_id, order_details.user_id, order_details.payment_id, order_details.address_id, order_details.order_total
    FROM cart_item
    JOIN order_details
    ON cart_item.cart_id = order_details.cart_id
),
product_info AS (# We can collect the sale price and quantity from these cart_items, and use the product_id FK to pull in more info about the product
SELECT purchase_items.user_id, purchase_items.cart_id, purchase_items.payment_id, purchase_items.address_id, purchase_items.product_id, purchase_items.item_qty, product.product_name, purchase_items.unit_price, (purchase_items.item_qty*purchase_items.unit_price) AS 'line_total', purchase_items.purchased_at
FROM purchase_items
INNER JOIN product
ON purchase_items.product_id = product.product_id
),
card_info AS (
SELECT product_info.user_id, product_info.cart_id, product_info.product_id, product_info.item_qty, product_info.product_name, product_info.unit_price, product_info.line_total, product_info.purchased_at, user_payment.provider, user_payment.card_number, user_payment.expiry, product_info.address_id
FROM product_info
INNER JOIN user_payment
ON product_info.payment_id = user_payment.payment_id
),
address_info AS (
SELECT card_info.cart_id, card_info.item_qty, card_info.product_name, card_info.unit_price, card_info.line_total, card_info.purchased_at, card_info.provider, card_info.card_number, card_info.expiry, card_info.user_id, user_address.address_line1, user_address.city, user_address.state, user_address.postal_code
FROM card_info
INNER JOIN user_address
ON card_info.user_id = user_address.user_id and user_address.is_primary_residence = True
)
SELECT address_info.cart_id, address_info.item_qty, address_info.product_name, address_info.unit_price, address_info.line_total, address_info.purchased_at, address_info.provider, address_info.card_number, address_info.expiry, user.first_name, user.last_name, address_info.address_line1, address_info.city, address_info.state, address_info.postal_code
FROM address_info
INNER JOIN user
ON address_info.user_id = user.user_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
2 rows affected.

[(1, 2, "'Men's Hooded Fleece'", Decimal('101.99'), Decimal('203.98'), datetime.datetime(2023, 5, 4, 4, 12, 46), "'CHASE'", "'4485202750970764'", "'05/2024'", "'Joe'", "'Murr'", "'8447C Airport Street'", "'Klamath Falls'", "'OR'", "'97603'"),
 (1, 4, "'Running Shoes'", Decimal('74.99'), Decimal('299.96'), datetime.datetime(2023, 5, 4, 4, 12, 46), "'CHASE'", "'4485202750970764'", "'05/2024'", "'Joe'", "'Murr'", "'8447C Airport Street'", "'Klamath Falls'", "'OR'", "'97603'")]

<h4>Let's see if the inventory update functions above did what they were supposed to.</h4>
product_id 2's inventory before was: <b>350</b><br>
product_id 4's inventory before was: <b>50</b><br>

In [73]:
%%sql 
SELECT product.product_id, product.product_name,  product_inventory.qty
FROM product_inventory 
JOIN product
ON product_inventory.product_id = product.product_id
WHERE product.product_id = 4 or product.product_id = 2;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
2 rows affected.

[(2, "'Men's Hooded Fleece'", 348), (4, "'Running Shoes'", 46)]